


// Дефолтно
&НаКлиенте
Перем ЗакрытиеЗапрещено;


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытиеЗапрещено И НЕ ЗавершениеРаботы Тогда
		
		ЗапроситьРазрешение();
		Отказ = Истина;
		
	КонецЕсли;     
	
КонецПроцедуры   

&НаКлиенте	
Асинх Процедура ЗапроситьРазрешение()
	
	Ответ = Ждать ВопросАсинх("Закрываем Форму?"
			, РежимДиалогаВопрос.ДаНет
			,, КодВозвратаДиалога.Нет
			, ЭтотОбъект.Окно.Заголовок);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		
		ЗакрытиеЗапрещено = Ложь;
		Закрыть();
		
	КонецЕсли;
КонецПроцедуры     

#Если Клиент  Тогда 
ЗакрытиеЗапрещено = Истина;
#КонецЕсли

