

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОпределитьПоляАдресаДоставки()
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПоляАдресаДоставки()        
	
	Тип = Новый ОписаниеТипов("Строка", ,
		Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));   
		
	НовыеРеквизиты = Новый Массив;
	
	Для каждого ЗаголовокПоля Из СтрРазделить(Константы.СтруктураАдресаДоставки.Получить(),",")  Цикл
		
		Имя = СтрЗаменить(ТРег(ЗаголовокПоля)," " , ""); 
		
		Реквизит = Новый РеквизитФормы(Имя, Тип,, ЗаголовокПоля, Истина);
		
		НовыеРеквизиты.Добавить(Реквизит);
		
	КонецЦикла;
	
	// Изменение Реквизитов Формы  	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Для каждого НовыйРеквизит Из НовыеРеквизиты Цикл 
		
		Элемент = Элементы.Добавить(НовыйРеквизит.Имя,Тип("ПолеФормы"), Элементы.АдресДоставки); 
	    Элемент.ПутьКДанным = НовыйРеквизит.Имя;
		Элемент.Вид = ВидПоляФормы.ПолеВвода; 
		
	КонецЦикла;	
	
КонецПроцедуры