

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Даты 
	
	// НачалоВремен
	//ДатаНачалаЗначение = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачала");
	//Если НЕ ЗначениеЗаполнено(ДатаНачалаЗначение.Значение) Тогда    
	//	
	//	ДатаНачалаЗначение.Значение = НачалоДня(Дата('00010101'));
	//	ДатаНачалаЗначение.Использование  = Истина;
	//	
	//КонецЕсли;
	
	
	//КонецВремен 
	ДатаОкончанияЗначение = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаОкончания");
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияЗначение.Значение) Тогда    
		
		ДатаОкончанияЗначение.Значение = КонецДня(Дата('39991231'));
		ДатаОкончанияЗначение.Использование  = Истина;
		
	КонецЕсли;
	
	// Собирать будем здесь
	ТекстЗапроса = Новый Массив; 
	
	
	// Обходим ВСЕ Документы текущей Конфы	
	Для каждого Документ Из Метаданные.Документы Цикл
		
		// Если НЕ ПЕРВЫЙ Элемент Массива	
		Если ТекстЗапроса.Количество() > 0 Тогда 			
			ТекстЗапроса.Добавить("ОБЪЕДИНИТЬ ВСЕ");			
		КонецЕсли;
		
		// формируем Текст для каждого вида Док-в   
		
		Текст = 	
		"ВЫБРАТЬ
		|	&Номер КАК Номер ,
		|	Документ.Дата КАК Дата,
		|	&ВидДокумента КАК ВидДокумента,
		|	&Ответственный КАК Ответственный
		|ИЗ
		|	Документ.ИмяДокумента КАК Документ
		|ГДЕ
		|	Документ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
		
		
		// Таблица
		Текст = СтрЗаменить(Текст,"ИмяДокумента", Документ.Имя); 
		// Вид  Документа
		Текст = СтрЗаменить(Текст,"&ВидДокумента", СтрШаблон("""%1""",Документ.Имя));
		
		Если Документ.Реквизиты.Найти("Ответственный")<> Неопределено Тогда 
			
			Текст = СтрЗаменить(Текст,"&Ответственный", "Документ.Ответственный");
			
		КонецЕсли;
		
		Если Документ.ДлинаНомера > 0 Тогда 
			
			Текст = СтрЗаменить(Текст,"&Номер", "Документ.Номер");
			
		КонецЕсли;
		
		// пишем в массив очередной Элемент
		ТекстЗапроса.Добавить(Текст);	
		
	КонецЦикла;  
	
	// Собираем в ОДИН Запрос
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СтрСоединить(ТекстЗапроса, Символы.ПС);
	
КонецПроцедуры
